### Join the gold prices together to have a consistent data set.
###Â I could do this in Excel but wanted to try and do it in Pandas.

### GOLD PRICES

### INCLUDES

In [2]:
import pandas as pd

In [9]:
first_gold_price = pd.read_csv("/Users/shogun/code/LAMBCS/lewagon_project/data/raw_data/daily_gold_rate.csv", index_col="Date")

In [10]:
first_gold_price.head()

               USD     EUR     GBP      INR      AED    CNY
Date
1985-01-01  308.30  402.45  266.01  3825.85  1134.42    NaN
1985-01-02  305.50  401.49  266.00  3787.05  1134.42    NaN
1985-01-03  302.30  397.08  262.76  3718.88  1107.67    NaN
1985-01-04  303.15  397.15  262.58  3759.64  1118.21    NaN
1985-01-07  298.25  392.55  261.17  3741.23  1091.58  835.8

In [13]:
first_gold_price.tail()

                USD      EUR      GBP        INR      AED       CNY
Date
2023-10-02  1833.05  1747.59  1513.92  152333.60  6732.79  13377.60
2023-10-03  1822.45  1741.97  1509.28  151684.52  6693.86  13300.24
2023-10-04  1818.95  1730.36  1496.83  151375.75  6680.82  13274.70
2023-10-05  1819.45  1726.89  1493.80  151431.00  6682.84  13278.35
2023-10-06  1819.60  1720.01  1487.33  151268.44  6683.39  13278.35

In [11]:
second_gold_price = pd.read_csv("/Users/shogun/code/LAMBCS/lewagon_project/data/raw_data/XAU_1d_data gold to 2025.csv", sep=';', index_col='Date')

In [12]:
second_gold_price.head()

                   Open   High    Low  Close  Volume
Date
2004.06.11 00:00  384.0  384.8  382.8  384.1     272
2004.06.14 00:00  384.3  385.8  381.8  382.8    1902
2004.06.15 00:00  382.8  388.8  381.1  388.6    1951
2004.06.16 00:00  387.1  389.8  382.6  383.8    2014
2004.06.17 00:00  383.6  389.3  383.0  387.6    1568

In [14]:
second_gold_price.tail()

                     Open     High      Low    Close  Volume
Date
2025.07.09 00:00  3301.97  3316.75  3282.64  3313.34  606759
2025.07.10 00:00  3313.26  3330.22  3310.02  3323.63  534692
2025.07.11 00:00  3323.57  3368.65  3321.75  3355.58  836228
2025.07.14 00:00  3364.09  3374.98  3340.95  3342.94  781945
2025.07.15 00:00  3343.04  3366.25  3320.17  3327.27  545183

In [17]:
second_gold_price.index.inferred_type

'string'

In [18]:
first_gold_price.index.inferred_type

'string'

In [20]:
first_gold_price.index = pd.to_datetime(first_gold_price.index)

In [22]:
second_gold_price.index = pd.to_datetime(second_gold_price.index)

In [21]:
first_gold_price.index.inferred_type

'datetime64'

In [23]:
second_gold_price.index.inferred_type

'datetime64'

In [24]:
first_gold_price.head()

               USD     EUR     GBP      INR      AED    CNY
Date
1985-01-01  308.30  402.45  266.01  3825.85  1134.42    NaN
1985-01-02  305.50  401.49  266.00  3787.05  1134.42    NaN
1985-01-03  302.30  397.08  262.76  3718.88  1107.67    NaN
1985-01-04  303.15  397.15  262.58  3759.64  1118.21    NaN
1985-01-07  298.25  392.55  261.17  3741.23  1091.58  835.8

In [25]:
second_gold_price.head()

             Open   High    Low  Close  Volume
Date
2004-06-11  384.0  384.8  382.8  384.1     272
2004-06-14  384.3  385.8  381.8  382.8    1902
2004-06-15  382.8  388.8  381.1  388.6    1951
2004-06-16  387.1  389.8  382.6  383.8    2014
2004-06-17  383.6  389.3  383.0  387.6    1568

In [34]:
first_gold_price.query("Date < '2004-06-11'")['USD']

Date
1985-01-01    308.30
1985-01-02    305.50
1985-01-03    302.30
1985-01-04    303.15
1985-01-07    298.25
               ...
2004-06-04    388.30
2004-06-07    393.60
2004-06-08    392.35
2004-06-09    386.85
2004-06-10    384.95
Name: USD, Length: 5073, dtype: float64

In [35]:
second_gold_price.query("Date >= '2004-06-11'")["Close"]

Date
2004-06-11     384.10
2004-06-14     382.80
2004-06-15     388.60
2004-06-16     383.80
2004-06-17     387.60
               ...
2025-07-09    3313.34
2025-07-10    3323.63
2025-07-11    3355.58
2025-07-14    3342.94
2025-07-15    3327.27
Name: Close, Length: 5418, dtype: float64

In [37]:
gold_price_data = pd.concat([first_gold_price.query("Date < '2004-06-11'")['USD'], second_gold_price.query("Date >= '2004-06-11'")["Close"]], axis=0)

In [38]:
gold_price_data.head()

Date
1985-01-01    308.30
1985-01-02    305.50
1985-01-03    302.30
1985-01-04    303.15
1985-01-07    298.25
dtype: float64

In [46]:
gold_price_data_df = pd.DataFrame(gold_price_data, columns=['Close'])

In [51]:
gold_price_data_df.tail()

              Close
Date
2025-07-09  3313.34
2025-07-10  3323.63
2025-07-11  3355.58
2025-07-14  3342.94
2025-07-15  3327.27

In [50]:
gold_price_data_df.index.inferred_type

'datetime64'

In [52]:
gold_price_data_df.to_csv("/Users/shogun/code/LAMBCS/lewagon_project/data/hostorical_gold_price_1985-01-07_2025_07_15")